
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ДокументПроведён(ПараметрКоманды) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала проведите документ'"));
		Возврат;
	КонецЕсли;
	
	ТабДок = СформироватьПечатнуюФорму(ПараметрКоманды);
	ТабДок.Показать("Начисления веб-мастерам");
	
КонецПроцедуры

&НаСервере
Функция ДокументПроведён(ДокументСсылка)
	
	Возврат ДокументСсылка.Проведен;
	
КонецФункции

&НаСервере
Функция СформироватьПечатнуюФорму(ДокументСсылка)
	
	Возврат Документы.НачислениеВебМастерам.СформироватьПечатнуюФорму(ДокументСсылка);
	
КонецФункции
