
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	АктСсылка = Неопределено;
	Попытка
		АктСсылка = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;
	Исключение
	КонецПопытки;
	Если АктСсылка = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда доступна из формы документа'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ АктПроведён(АктСсылка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала проведите документ'"));
		Возврат;
	КонецЕсли;
	
	ТабДок = СформироватьПечатнуюФорму(АктСсылка);
	ТабДок.Показать("Акт клиенту");
	
КонецПроцедуры

&НаСервере
Функция АктПроведён(АктСсылка)
	
	Возврат АктСсылка.Проведен;
	
КонецФункции

&НаСервере
Функция СформироватьПечатнуюФорму(АктСсылка)
	
	Возврат Документы.АктКлиенту.СформироватьПечатнуюФорму(АктСсылка);
	
КонецФункции
