
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ АктПроведён(ПараметрКоманды) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала проведите документ'"));
		Возврат;
	КонецЕсли;
	
	ТабДок = СформироватьПечатнуюФорму(ПараметрКоманды);
	ТабДок.Показать("Акт клиенту");
	
КонецПроцедуры

&НаСервере
Функция АктПроведён(АктСсылка)
	
	Возврат АктСсылка.Проведен;
	
КонецФункции

&НаСервере
Функция СформироватьПечатнуюФорму(АктСсылка)
	
	Возврат Документы.АктКлиенту.СформироватьПечатнуюФорму(АктСсылка);
	
КонецФункции
