
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УпрВалюта = Константы.УправленческаяВалюта.Получить();
	
	Движения.ВзаиморасчётыСВебМастерами.Записывать = Истина;
	Движение = Движения.ВзаиморасчётыСВебМастерами.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.ВебМастер = ВебМастер;
	Если Валюта.Пустая() Тогда
		Движение.Валюта = Константы.УправленческаяВалюта.Получить();
	Иначе
		Движение.Валюта = Валюта;
	КонецЕсли;
	Движение.Сумма = Сумма;
	Движение.СуммаУпр = Сумма;
	
КонецПроцедуры
