
Процедура ПриНачалеРаботыСистемы(Отказ)
	
	ПодключитьОбработчикОжидания("ЗапуститьТесты", 1, Истина);
	
КонецПроцедуры

Процедура ЗапуститьТесты() Экспорт
	
	М = Новый ЗаписьТекста("C:\Bases\WeKings_appmarker.txt", КодировкаТекста.UTF8);
	М.ЗаписатьСтроку("обработчик ожидания: старт");
	Попытка
		Результат = Пинг();
		М.ЗаписатьСтроку("пинг: " + Результат);
	Исключение
		М.ЗаписатьСтроку("ОШИБКА ПИНГА: " + ОписаниеОшибки());
	КонецПопытки;
	Попытка
		ВыполнитьВсеТесты();
		М.ЗаписатьСтроку("тесты завершены");
	Исключение
		М.ЗаписатьСтроку("ОШИБКА ВЫЗОВА: " + ОписаниеОшибки());
	КонецПопытки;
	М.Закрыть();
	ЗавершитьРаботуСистемы(Ложь);
	
КонецПроцедуры
