
Функция ПолучитьКурс(ВалютаОтбора, НаДату) Экспорт
	
	Если ВалютаОтбора = Константы.УправленческаяВалюта.Получить() Тогда
		Возврат 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс КАК Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("Период", НаДату);
	Запрос.УстановитьПараметр("Валюта", ВалютаОтбора);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Курс > 0 Тогда
		Возврат Выборка.Курс;
	КонецЕсли;
	ВызватьИсключение СтрШаблон("Не задан курс валюты ""%1"" на дату %2. Заполните регистр сведений ""Курсы валют"".",
		ВалютаОтбора, Формат(НаДату, "ДЛФ=D"));
	
КонецФункции
