
Функция СформироватьПечатнуюФорму(ДокументСсылка) Экспорт
	
	Макет = Документы.РасходНаРекламу.ПолучитьМакет("МакетРасхода");
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходНаРекламу.Номер КАК Номер,
	|	РасходНаРекламу.Дата КАК Дата,
	|	РасходНаРекламу.Кампания КАК Кампания,
	|	РасходНаРекламу.Кампания.Канал КАК Канал,
	|	РасходНаРекламу.СуммаУпр КАК СуммаУпр
	|ИЗ
	|	Документ.РасходНаРекламу КАК РасходНаРекламу
	|ГДЕ
	|	РасходНаРекламу.Ссылка = &Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Номер = Шапка.Номер;
	Область.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=D");
	Область.Параметры.Кампания = Шапка.Кампания;
	Область.Параметры.Канал = Шапка.Канал;
	Область.Параметры.СуммаУпр = Формат(Шапка.СуммаУпр, "ЧДЦ=2; ЧН=0,00");
	Область.Параметры.Валюта = Константы.УправленческаяВалюта.Получить();
	ТабДок.Вывести(Область);
	ТабДок.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
	Возврат ТабДок;
	
КонецФункции
