
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Акт.Статус <> Перечисления.СтатусыАкта.Выставлен Тогда
		Сообщить("Оплата проводится только по акту в статусе ""Выставлен"".");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВалютаАкта = Акт.Валюта;
	Курс = РаботаСВалютами.ПолучитьКурс(ВалютаАкта, Дата);
	
	Движения.ВзаиморасчётыСКлиентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчётыСКлиентами.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Клиент = Акт.Клиент;
	Движение.Валюта = ВалютаАкта;
	Движение.Сумма = Сумма;
	Движение.СуммаУпр = Сумма * Курс;
	
	АктОбъект = Акт.ПолучитьОбъект();
	АктОбъект.Статус = Перечисления.СтатусыАкта.Оплачен;
	АктОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры
